Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/A25D.tmx
Source language: en_us
Languages: zh_cn

source: Adobe's Plan to Make Your iPad as Good as Your Desktop
zh_cn: Adobe的计划：让你的iPad媲美笔记本

source: FOR SOME TIME now, the iPad has struggled to gain meaningful traction with users.
zh_cn: 一段时间以来，iPad在获得用户认可方面表现挣扎。

source: Heralded in 2010 as the Goldilocks just-right device for tasks like checking email, browsing online, and playing games, that was no longer the case just a few years later.
zh_cn: 2010年iPad宣布以“刚刚好”适合查看邮件，浏览网页，玩游戏的设备的定位，在几年后的现在看来，已经远远不能满足用户的需求了。

source: Today we have much bigger smartphones, featherlight laptops, and a flimsy understanding of how to best put our midsize tablets to use.
zh_cn: 如今我们有更大屏幕的智能手机，超薄笔记本。但是对于如何最好地利用我们的大小居中的平板电脑，我们却知之甚少。

source: Apple's latest addition to the iPad lineup, the iPad Pro, aims to resolve this confusion.
zh_cn: 苹果最新出的iPad阵营当中增加的iPad pro，致力于解决这个困惑。

source: It's a bigger, more powerful tablet that Apple Senior VP Phil Schiller demoed onstage with some of Adobe's new apps.
zh_cn: 它是一个尺寸更大，配置也更强大的平板电脑，由苹果高级副总裁菲尔·席勒在舞台上展示其配置的新款Adobe公司开发的应用软件。

source: It was a particularly fitting way to introduce a device meant for work, because Adobe has, for more than a year now, been pushing for professional creativity on mobile devices.
zh_cn: 这是一个非常合适的方式去诠释一部终端设备对于工作的意义。因为Adobe公司早在一年多以前就开始在移动设备上推行一个专业的创新。

source: CreativeSync, a new Adobe technology, is the company's latest bid to make that happen.
zh_cn: CreativeSync，Adobe的一项新技术，是该公司最新全力开发的一项技术。

source: CreativeSync runs in the background of Adobe's cloud and is like a seamless, 360-degree bridge linking all of Adobe's apps (third party apps get access soon).
zh_cn: CreativeSync在Adobe云技术的背景下运行，他就像一个无缝对接的，360度全方位的桥梁，连接着Adobe的各种应用软件（很快第三方软件也可以访问）。

source: If you're editing an image in Photoshop, but need to quickly add text in InDesign, then bounce the file back to Photoshop, CreativeSync lets you do this with a couple of quick taps.
zh_cn: 如果你正在on个Photoshopvia编辑一张图片，但是同时你又需要在indesign软件中快速输入文本，然后再弹回Photoshop继续处理图片的话，通过CreativeSync，你只要用几个快捷键就可以实现了。

source: The goal, plain and simple, is to turn mobile platforms into a places you can actually do work.
zh_cn: 简而言之，其目的就是把移动平台变成你能真正工作的地方。
